[进程窗口_重复共用]
AutohotkeyU32=Autohotkey
AutohotkeyU64=Autohotkey
AutoHotkeyGUI=Autohotkey
WorkerW=Progman
Notepad2U=notepad
Uedit32=notepad
Code==notepad
SciTE=notepad

[窗口默认]
1=1182|窗口通用
2=1183|通用2
3=

[Autohotkey]
1=1182|窗口通用
2=1252|Ahk控制

[A_脚本控制]
1=1253|暂停脚本
2=1254|重启脚本
3=1255|编辑脚本
4=1256|挂起脚本
5=1257|暂停脚本
6=1258|退出脚本
7=5024|Notepad2

[窗口通用]
1=1050|复制标题
2=1127|复制进程路径
3=1151|复制命令行
4=1048|窗口进程目录
5=1047|运行窗口进程
6=1061|文档所在目录
7=1049|窗口置顶
8=1243|结束进程
9=1171|截取窗口
10=1125|窗口静音
11=1033|水平最大化
12=1034|垂直最大化

[窗口通用2]
1=1084|透明关
2=1068|透明75%
3=1069|透明50%
4=1244|结束进程
5=1230|结束进程
6=1051|结束同名所有
7=1176|AppId
8=1241|任务栏按钮
9=1247|加入Ini_Fav
10=1248|快捷方式到桌面
11=1260|窗口微缩0.3

[CabinetWClass]
1=1072|窗口通用
2=1083|窗口通用2
3=1012|CMD
4=1031|通用目录
5=1032|收藏夹
6=1041|收藏夹
7=1007|资源管理器
8=1179|当前文件夹
9=1121|最近打开
10=
11=
12=

[#32770]
1=1041|当前窗口打开
2=1226|打开的
3=1239|跳转
4=
5=
6=
7=
8=
9=
10=
11=
12=

[Progman]
1=1018|系统工具
2=1008|注册表相关
3=1075|常用工具
4=1124|重启桌面
5=1032|收藏夹
6=1076|隐藏图标
7=1093|搜索文件夹
8=1096|搜索文件内容
9=1122|无线调试
10=
11=

[通用目录]
1=1054|我的电脑
2=1055|回收站
3=1056|桌面
4=1147|控制面板
5=1148|库
6=1057|我的文档
7=1058|网络
8=1059|网络适配器
9=1060|上帝模式
10=1157|如意目录
11=1158|AppData
12=1159|Rencent

[自定义收藏夹]
1=5012|主脚本目录
2=5013|帮助目录
3=5014|脚本收集
4=5015|git目录
5=5016|如意
6=5044|Ahk
7=5061|微信接收
8=5062|Ahk_L

[收藏夹_当前窗口]
1=1042|C:\
2=5018|帮助目录
3=5019|脚本收集
4=5020|git目录
5=5017|主脚本目录
6=5021|如意

[资源管理器_当前文件夹]
1=1009|复制路径
2=1077|删空目录
3=1093|搜索文件夹
4=1096|搜索文件内容
5=1120|剪贴板至文件
6=1087|同步文件夹
7=1088|同步文件夹2
8=1178|FolderMenu
9=1232|新增Path

[资源管理器]
1=1115|显示隐藏
2=1116|隐藏文件
3=1117|显示扩展名
4=1118|隐藏扩展名
5=1089|同步文件夹
6=
7=
8=
9=
10=
11=
12=

[系统优化]
1=1003|导航栏
2=1004|打开方式
3=1001|电脑图标
4=1002|桌面图标
5=1005|电脑桌面图标
6=1006|快捷方式
7=1094|IP设置
8=1099|自定义运行
9=1114|环境变量
10=1231|环境变量

[常用工具]
1=1017|记事本
2=1019|计算器
3=1022|注册表
4=1026|CMD
5=1074|画图
6=1078|1h后关机
7=1079|取消关机
8=5029|FooBar
9=1227|系统属性
10=1150|PowerShell
11=

[系统工具]
1=1023|系统信息
2=1024|事件查看
3=1029|任务管理
4=1027|安全策略
5=1013|程序和功能
6=1015|服务管理
7=1016|任务管理器
8=1014|计算机管理
9=1020|主策略
10=1021|启动配置
11=1025|系统属性
12=1028|磁盘清理

[RegEdit_RegEdit]
1=1160|收藏夹
2=1169|复制路径

[注册表_收藏夹]
1=1161|开机启动项目
2=1162|系统服务
3=5054|收藏夹

[TaskManagerWindow]
1=1082|获取文本

[cmd]
1=1072|窗口通用
2=1042|C:\

[Wps]
1=1072|窗口通用
2=1061|文档所在目录
3=1163|快捷键
4=1166|输入为数值
5=1308|粘贴All
6=1312|列宽All
7=1314|水平对齐

[Excel_快捷键]
1=1139|冻结
2=1140|筛选
3=1164|全部边框
4=1165|粘贴为数值
5=1167|打印预览

[360se6_Frame]
1=1072|窗口通用
2=1183|通用2
3=1090|网址收藏夹
4=1221|收藏夹
5=1144|快捷键
6=5025|MsEdge打开
7=5045|Chrome打开


[Chrome_WidgetWin_1]
1=1072|窗口通用
2=1183|通用2
3=1090|网址收藏夹
4=1221|收藏夹
5=1062|AD_JS
6=1144|快捷键
7=1141|复制网址
8=1142|复制全部网址
9=5025|MsEdge打开
10=1153|Baidu/Bing
11=5030|360浏览器打开
12=

[Chrome_Js]
1=1063|编辑模式
2=1064|!编辑模式
3=1065|强制复制
4=1130|恐龙彩蛋
5=1131|Chrome URLs
6=1145|Chrome 设置
7=1210|完整歌单
8=1211|下一页

[Chrome_快捷键]
1=1132|下载内容
2=1133|历史记录
3=1134|调试器
4=1135|恢复标签
5=1136|关闭标签
6=1137|至底部
7=1138|至顶部
9=1216|收藏夹

[网址收藏夹]
1=5000|趣词
2=5001|InoReader
3=5002|Ahk 社区
4=5003|regdict
5=5004|Ahk论坛
6=5005|Bing
7=5006|B站
8=5007|v2 help
9=5008|foobar
10=5009|我的github
11=5010|v1 help
12=5011|网易云

[浏览器选择]
1=5046|Chrome打开
2=5047|360打开
3=5048|Edge打开

[浏览器收藏夹]
1=1222|360收藏夹
2=1223|Chrome收藏夹
3=1224|Edge收藏夹

[搜索引擎]
1=1152|Bing搜索
2=1154|京东搜索
3=1156|B站搜索

[编辑器打开]
1=1129|记事本
2=5022|UltraEdit
3=5023|VSCode
4=5024|Notepad2

[文本编辑器]
1=1011|记事本打开
2=5026|VScode打开
3=5027|UEdit打开
4=5028|NotePad2打开
5=5059|SciTE打开

[Notepad]
1=1072|窗口通用
2=1083|窗口通用2
3=1121|最近打开
4=1061|文档所在目录
5=1128|其他编辑
6=1126|浏览器打开

[adb]
1=1122|无线调试
2=1218|连接手机
3=1123|开启黑域
4=1217|到手机
5=5051|到手机2
6=1262|Adb 命令
7=

[如意]
1=1263|热字串管理
2=1192|动作管理
3=1264|面板管理
4=1233|搜索动作
5=1157|如意目录
6=1313|如意托盘








[扩展名_重复共用]
ahk2=ahk
7z=zip
m4a=mp4
wma=mp3

[文件默认]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1146|编辑器
5=1213|Ini_Opw

[无选中]
1=1193|最多运行
2=1196|最近运行
3=1192|动作管理
4=1168|关闭显示器
5=1172|截取屏幕
6=5038|WiFi
7=1199|窗口列表
8=1212|Ini_Fav
9=1215|Adb
10=1265|设置如意
11=1315|剪贴板
12=1317|Ini_Fav

[短文本]
1=1203|文本通用
2=1097|百度搜索
3=1173|二维码
4=1037|打开选中
5=1110|搜索帮助
6=1112|有道翻译
7=1155|搜索引擎
8=1242|文本处理
9=1186|百度网盘
10=5049|浏览器
11=1204|数字通用
12=1092|查看编码

[长文本]
1=1098|文本比较1
2=1100|文本比较2
3=1173|二维码
4=1037|打开选中
5=1186|百度网盘
6=5049|浏览器
7=1052|复制路径
8=1242|文本处理

[盘符]
1=1174|更改盘符
2=1175|序列号

[文件夹]
1=1184|目录通用
2=1040|解散目录
3=1093|搜索文件夹
4=1037|打开选中
5=1177|FolderMenu
6=1212|Ini_Fav
7=1249|文件夹结构
8=1229|查找重复
9=1316|管理编码

[文件夹通用]
1=1037|打开选中
2=1052|复制路径
3=1073|永久删除
4=1066|获取权限
5=1045|软硬链接
6=1206|还原图标
7=1269|文件列表
8=1297|文件列表
9=1303|ADS管理
10=1309|软链接管理
11=1310|硬链接管理

[多文件]
1=1266|通用菜单
2=1119|复制文件名
3=1052|复制路径
4=1081|交换文件名
5=1046|文件属性
6=1067|合并文件
7=1109|复制/移动到打开的
8=1108|移动到Music
9=1044|转码

[多文件通用]
1=1119|复制文件名
2=1052|复制(路径)
3=1046|文件属性
4=1039|放入同名
5=1073|永久删除
6=1109|复制/移动到打开的
7=1267|移至新文件夹
8=1269|文件列表
9=1302|复制信息
10=1304|添加 ADS

[文件通用]
1=1251|复制文件名
2=1052|复制(路径)
3=1046|文件属性
4=1039|放入同名
5=1073|永久删除
6=1109|复制/移动到打开的
7=1066|获取权限
8=1011|记事本打开
9=1037|打开选中
10=1071|打开方式
11=1070|预览文件
12=1214|百度搜索

[文件通用2]
1=1101|MD5对比1
2=1102|MD5对比2
3=1080|MD5
4=1095|Hash
5=1103|Hash2
6=1036|文件改名
7=1085|快捷方式到桌面
8=1208|关联图标
9=5050|文件解锁
10=1213|Ini_OPw
11=1219|到手机
12=1268|放入剪贴板

[文件通用3]
1=1045|软硬链接
2=1311|软硬链接检查
3=1269|Zip压缩
4=1304|添加 ADS
5=1212|Ini_Fav

[短文本通用]
1=1092|查看编码
2=1097|百度搜索
3=1037|打开选中
4=1110|搜索帮助
5=1111|搜索v2帮助
6=1112|有道翻译
7=1155|搜索引擎
8=1173|二维码
9=1186|百度网盘
10=1204|数字通用
11=1228|搜狗翻译

[数字通用]
1=1200|进制转换
2=1201|对应颜色
3=1296|时间戳

[txt]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1146|编辑器
5=1098|文本比较1
6=1100|文本比较2
7=1011|记事本打开
8=1044|转码
9=1220|放入剪贴板

[ahk]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1146|编辑器
5=1098|文本比较1
6=1100|文本比较2
7=5033|U32打开
8=1044|转码
9=5034|2.0打开
10=5035|2打开_64
11=5036|编译
12=1225|文件库搜索

[ini]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1146|编辑器
5=1098|文本比较1
6=1100|文本比较2

[apk]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=5053|Winrar
5=5052|到手机

[jpg]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1104|缩小50%
5=1105|灰度图像
6=1106|放入剪贴板
7=1107|品质压缩

[chm]
1=1010|文件通用
2=1181|通用2
3=1237|chm解压

[lnk]
1=1053|打开目标目录
3=1038|编辑
2=1149|复制目标路径

[doc]
1=1010|文件通用
2=1181|通用2
3=1245|通用3

[xls]
1=1010|文件通用
2=1181|通用2
3=1245|通用3

[mp3]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1108|移动到Music
5=1070|预览文件
6=1238|前后交换

[mp4]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1108|移动到Music
5=1070|预览文件
6=1238|前后交换
7=5055|Yamb

[exe]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=5037|打开_RH
5=1205|Ex图标
6=1207|提取图标
7=5050|文件解锁

[Dll]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1197|DllFunc
5=1207|提取图标
6=1234|Dll注册
7=1235|Dll卸载
8=5050|文件解锁

[Rar]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1198|智能解压
5=1271|Rar解缩

[Zip]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1198|智能解压
5=1270|Zip解缩

[png]
1=1010|文件通用
2=1181|通用2
3=1245|通用3
4=1105|灰度图像
4=1105|灰度图像
6=1106|放入剪贴板

[剪贴板通用]
1=1305|HTML转文本
2=1306|文本转HTML
